----------------------------------------------------------------------------------------------------

-- de Bruijn indices

module DBI {𝓍} {X : Set 𝓍} where

open import Prelude public


----------------------------------------------------------------------------------------------------

infix 3 _∋_
data _∋_ : Tsil X → X → Set 𝓍 where
  zero : ∀ {Γ A} → Γ , A ∋ A
  wk∋  : ∀ {B Γ A} (i : Γ ∋ A) → Γ , B ∋ A


----------------------------------------------------------------------------------------------------

-- TODO: delete?

injwk∋ : ∀ {Γ A B} {i i′ : Γ ∋ A} → wk∋ i ≡ wk∋ {B} i′ → i ≡ i′
injwk∋ refl = refl

infix 4 _≟∋_
_≟∋_ : ∀ {Γ A} (i i′ : Γ ∋ A) → Dec (i ≡ i′)
zero  ≟∋ zero   = yes refl
zero  ≟∋ wk∋ i′ = no λ ()
wk∋ i ≟∋ zero   = no λ ()
wk∋ i ≟∋ wk∋ i′ with i ≟∋ i′
... | yes refl    = yes refl
... | no ¬eq      = no λ { refl → refl ↯ ¬eq }


----------------------------------------------------------------------------------------------------
